app/views/posts/index.html.erb

<h1>Welcome to PERSON SAYFA</h1>
<% user=User.find(session[:user_id]) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]