app/views/posts/new.html.erb

    <p>
      <% user=User.find(session[:user_id]) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]