app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "posts" ("content", "created_at", "title", "updated_at", "us_id") VALUES (?, ?, ?, ?, ?)  [["content", "1"], ["created_at", Mon, 05 May 2014 19:03:18 UTC +00:00], ["title", "1"], ["updated_at", Mon, 05 May 2014 19:03:18 UTC +00:00], ["us_id", 1]]
---
  def create
    @post =Post.new(params[:post])
    user=User.find(session[:user_id])
    @post.us_id= user.id
    if 	@post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = 7  [["content", "int myFunc(int x,int y){\r\n\r\n\treturn x+y;\r\n}"], ["updated_at", Sat, 10 May 2014 20:39:06 UTC +00:00]]
---
  def update
    @post=Post.find(params[:id])
    if @post.update_attributes(params[:post])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 6]]
---
  def destroy

    @post=Post.find(params[:id])
    if (post.title.last=='c')
      FileUtils.rm(@post.us_id.to_s+".c")
    else
      FileUtils.rm(@post.us_id.to_s+".h")
    end
    @post.destroy