app/controllers/sessions_controller.rb

	def create
		user = User.validate_login(params[:session][:email], params[:session][:password])
		if user
			session[:user_id] = user.id
      $user_first_name = user.first_name
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'ferkartal@gmail.com' LIMIT 1