app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    if @user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password", "updated_at") VALUES (?, ?, ?, ?, ?, ?)